package 변수및자료형;

public class Ex02변수명 {

	public static void main(String[] args) {
		
		// 변수명 작성 규칙
		// 1. 키워드 사용 불가
		// ---> eclipse에서 작성 시 색깔이 변한다면 키워드
		// 2. 대소문자를 구분하고 길이에는 제한이 없다
		// ---> 변수명은 의미전달이 중요하다. a,b,c,d 이렇게 짓지 말기
		// 3. 숫자로 시작할 수 없다.
		// ---> 숫자를 값으로 인식한다.
		// 4. 특수문자 _와 $만 사용가능.
		
		// 자바 개발자에게 권장되는 규칙들
		// 1. 변수 이름의 시작은 소문자로!
		// 2. 여러글자로 이루어진 경우에는 이어지는 단어의 첫글자를 대문자로하기
		// ---> 카멜식 기법(Camel)
		// ex) int inputNumber = 4;
		//     python : 스네이크 기법 input_number
		
		
		
		
		

	}

}
